/*
  Localizable.strings (English)
  ClipArc

  Created by Adam Lyu on 2026-01-22.
*/

// MARK: - Common
"app.name" = "ClipArc";
"common.enable" = "Enable";
"common.disable" = "Disable";
"common.cancel" = "Cancel";
"common.done" = "Done";
"common.save" = "Save";
"common.delete" = "Delete";
"common.copy" = "Copy";
"common.paste" = "Paste";
"common.search" = "Search";
"common.settings" = "Settings";
"common.continue" = "Continue";
"common.skip" = "Skip";
"common.skip_for_now" = "Skip for now";
"common.edit" = "Edit";
"common.select_all" = "Select All";

// MARK: - Language
"language.system" = "System Default";

// MARK: - Onboarding Welcome
"onboarding.welcome.title" = "Welcome to ClipArc";
"onboarding.welcome.subtitle" = "Your smart clipboard manager for macOS";
"onboarding.welcome.get_started" = "Get Started";

// MARK: - Onboarding Features
"onboarding.feature.history.title" = "Clipboard History";
"onboarding.feature.history.description" = "Access everything you've copied";
"onboarding.feature.search.title" = "Instant Search";
"onboarding.feature.search.description" = "Find any clip in seconds";
"onboarding.feature.hotkey.title" = "Global Hotkey";
"onboarding.feature.hotkey.description" = "⇧⌘V from anywhere";

// MARK: - Onboarding Permissions
"onboarding.permissions.title" = "Permissions";
"onboarding.permissions.subtitle" = "ClipArc needs a few permissions to work its magic";
"onboarding.permissions.accessibility.title" = "Accessibility";
"onboarding.permissions.accessibility.description" = "Required to auto-paste content";
"onboarding.permissions.launch_at_login.title" = "Launch at Login";
"onboarding.permissions.launch_at_login.description" = "Start ClipArc automatically";

// MARK: - Onboarding Sign In
"onboarding.signin.title" = "Sign In";
"onboarding.signin.subtitle" = "Sign in with Apple to sync across devices";
"onboarding.signin.signed_in_as" = "Signed in as";
"onboarding.signin.sign_in_later" = "You can sign in later in Settings";

// MARK: - Onboarding Subscription
"onboarding.subscription.title" = "Unlock Your Full Potential";
"onboarding.subscription.subtitle" = "Never lose a copied item again";
"onboarding.subscription.subscribe" = "Subscribe";
"onboarding.subscription.start_free_trial" = "Continue with Free";
"onboarding.subscription.free_vs_pro" = "Free: 5 items · Pro: Unlimited";
"onboarding.subscription.you_are_pro" = "You're a Pro!";
"onboarding.subscription.save_44" = "BEST VALUE";
"onboarding.subscription.benefit1" = "Unlimited clipboard history";
"onboarding.subscription.benefit2" = "Save text, images & files";
"onboarding.subscription.benefit3" = "Instant search across all clips";
"onboarding.subscription.benefit4" = "Private & secure local storage";

// MARK: - Onboarding Complete
"onboarding.complete.title" = "You're All Set!";
"onboarding.complete.subtitle" = "ClipArc is ready to use";
"onboarding.complete.start_using" = "Start Using ClipArc";
"onboarding.complete.tip.open" = "Open clipboard history";
"onboarding.complete.tip.navigate" = "Navigate items";
"onboarding.complete.tip.paste" = "Paste selected item";
"onboarding.complete.tip.close" = "Close panel";

// MARK: - Settings
"settings.title" = "Settings";
"settings.general" = "General";
"settings.account" = "Account";
"settings.subscription" = "Subscription";
"settings.about" = "About";

"settings.history_limit" = "History Limit";
"settings.items" = "items";
"settings.startup" = "Startup";
"settings.launch_at_login" = "Launch at Login";
"settings.show_in_dock" = "Show in Dock";
"settings.hotkey" = "Hotkey";
"settings.global_hotkey" = "Global Hotkey";
"settings.permissions" = "Permissions";
"settings.granted" = "Granted";
"settings.language" = "Language";
"settings.restart_required" = "Restart app to apply language change";
"settings.appearance" = "Appearance";
"settings.appearance.system" = "System";
"settings.appearance.light" = "Light";
"settings.appearance.dark" = "Dark";

"settings.sign_out" = "Sign Out";
"settings.sync_description" = "Sign in to sync your data across devices";
"settings.member_account" = "Member Account";
"settings.sign_in_description" = "Sign in to verify your membership";
"settings.account_linked" = "Account Linked";
"settings.benefit_membership" = "Verify Pro membership";
"settings.benefit_restore" = "Restore purchases easily";
"settings.benefit_multi_device" = "Same account across devices";
"settings.login_required" = "Sign In Required";
"settings.login_required_message" = "Please sign in with your Apple ID first to subscribe. Go to the Account tab to sign in.";
"settings.go_to_account" = "OK";
"settings.accessibility_guide" = "System Settings → Privacy & Security → Accessibility → Enable ClipArc";

"settings.pro_badge" = "ClipArc Pro";
"settings.lifetime_license" = "Lifetime License";
"settings.renews_on" = "Renews %@";
"settings.manage_subscription" = "Manage Subscription";
"settings.upgrade_to_pro" = "Upgrade to Pro";
"settings.upgrade_description" = "Get unlimited clipboard history and more";
"settings.restore_purchases" = "Restore Purchases";

"settings.version" = "Version";
"settings.about_description" = "A fast and simple clipboard manager for macOS";
"settings.support" = "Support";
"settings.privacy" = "Privacy";
"settings.terms" = "Terms";

"settings.storage" = "Storage";
"settings.cache_size" = "Cache Size";
"settings.history_items" = "History Items";
"settings.clear_cache" = "Clear Cache";
"settings.clear_cache_message" = "This will remove all cached images and thumbnails. Your clipboard history will be preserved.";
"settings.clear_all_history" = "Clear All History";
"settings.clear_history_message" = "This will permanently delete all clipboard history. This action cannot be undone.";
"settings.clear" = "Clear";

// MARK: - Clipboard
"clipboard.empty.title" = "No Clips Yet";
"clipboard.empty.subtitle" = "Copy something to get started";
"clipboard.search.placeholder" = "Search clips...";
"clipboard.search.no_results" = "No results found";
"clipboard.copied" = "Copied";
"clipboard.pasted" = "Pasted";

"clipboard.type.all" = "All";
"clipboard.type.frequent" = "Frequent";
"clipboard.type.text" = "Text";
"clipboard.type.image" = "Image";
"clipboard.type.file" = "File";
"clipboard.type.link" = "Link";
"clipboard.delete_selected" = "Delete Selected";

// MARK: - Menu Bar
"menu.show_panel" = "Show ClipArc";
"menu.preferences" = "Preferences...";
"menu.clear_history" = "Clear History";
"menu.about" = "About ClipArc";
"menu.help" = "Help";
"menu.quit" = "Quit ClipArc";

// MARK: - Rating
"rating.title" = "Enjoying ClipArc?";
"rating.subtitle" = "Your feedback helps us improve";
"rating.yes_love_it" = "Yes, Love It!";
"rating.not_really" = "Not Really";

// MARK: - Errors
"error.generic" = "An error occurred. Please try again.";
"error.auth_failed" = "Authentication failed. Please try again.";
"error.purchase_failed" = "Purchase failed. Please try again.";
"error.network" = "Network error. Please check your connection.";

// MARK: - Time
"time.just_now" = "Just now";
"time.minutes_ago" = "%d min ago";
"time.hours_ago" = "%d hr ago";
"time.yesterday" = "Yesterday";
"time.days_ago" = "%d days ago";

// MARK: - Toast
"toast.running" = "Running in background";

// MARK: - Paste Dialog
"paste.direct_paste_title" = "Paste directly to %@?";
"paste.direct_paste_subtitle" = "ClipArc needs accessibility access to paste directly to other apps.";
"paste.enable_direct_paste" = "Enable Direct Paste";
"paste.copy_to_clipboard" = "Not Now, Copy to Clipboard";
"paste.dont_ask_again" = "Don't ask again";
"paste.press_to_manual_paste" = "Press ⌘V to paste";

// MARK: - Settings Paste Mode
"settings.paste_mode" = "Paste Mode";
"settings.paste_mode.ask" = "Ask each time";
"settings.paste_mode.direct_paste" = "Always direct paste";
"settings.paste_mode.copy_only" = "Always copy only";

// MARK: - Accessibility Setup
"accessibility.setup.title" = "Enable Accessibility Access";
"accessibility.setup.subtitle" = "To paste directly to other applications, allow ClipArc to access the accessibility features of your Mac in System Settings.";
"accessibility.open_system_settings" = "Open System Settings";
"accessibility.having_issue" = "I'm Having an Issue";
